<h1 style="color:blue">Arithmetic Operations in Pandas</h1>

# Import numpys and pandas

In [1]:
import numpy as np
import pandas as pd

# Create two pd.Series objects, s1 and s2, using the NumPy library and assign them to variables.

In [2]:
s1 = pd.Series (np.arange(4), index = ['a', 'c','d','e'])
s2= pd.Series(np.arange(5), index = ['a', 'c','e','f','g'])
print(s1)
print(s2)

a    0
c    1
d    2
e    3
dtype: int64
a    0
c    1
e    2
f    3
g    4
dtype: int64

# Perform an addition operation between the two pd.Series objects s1 and s2

In [3]:
s1+s2

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

# Create two pandas DataFrames, df1 and df2, using the NumPy library. 

# For df 1
Using numpys arange and reshape argument generate a sequence of numbers from 0 to 5 and reshape it into 2 x 3 matrix
The columns parameter is set to list("ABC"), which assigns column labels "A", "B", and "C" to the DataFrame columns. 
The index parameter is set to ["Tim", "Tom"], providing row labels for the DataFrame.

# For df2
Generates a sequence of numbers from 0 to 8 and reshapes it into a 3x3 array. <br>
The columns parameter is set to list("ACD"), which assigns column labels "A", "C", and "D" to the DataFrame columns. <br>
The index parameter is set to ["Tim", "Kate", "Tom"], providing row labels for the DataFrame.

In [7]:
df1 = pd.DataFrame(np.arange(6).reshape(2,3),
                  index = ["Tim", "Tom"],
                  columns = list("ABC"))
df2 = pd.DataFrame(np.arange(9).reshape(3,3),
                  index= ["Tim", "Kate", "Tom"],
                  columns = list('ACD'))
print(df1)
print(df2)

     A  B  C
Tim  0  1  2
Tom  3  4  5
      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

# Perform an addition operation between the two pandas DataFrames df1 and df2. When performing arithmetic operations on DataFrames, the operation should be aligned based on both the column labels and the index labels.

In [8]:
df1 + df2

        A   B     C   D
Kate  NaN NaN   NaN NaN
Tim   0.0 NaN   3.0 NaN
Tom   9.0 NaN  12.0 NaN

# Perform an addition operation between the two pandas DataFrames df1 and df2, while filling missing values with 0. Use The add() function to perform element-wise addition between the two DataFrames, and fill_value parameter to  0 to replace any missing values with 0 during the addition.

In [9]:
df1.add(df2, fill_value=0)

        A    B     C    D
Kate  3.0  NaN   4.0  5.0
Tim   0.0  1.0   3.0  2.0
Tom   9.0  4.0  12.0  8.0

# Perform element-wise division on the DataFrame df1, where each element is divided by 1.

In [10]:
1/df1

            A     B    C
Tim       inf  1.00  0.5
Tom  0.333333  0.25  0.2

# Task

# Perform element-wise multiplication on the DataFrame df1, where each element is multiplied by 3.

In [12]:
df1*3

     A   B   C
Tim  0   3   6
Tom  9  12  15

# Perform element-wise multiplication on the DataFrame df1 by the scalar value 3 using the mul() function.

In [13]:
df1.mul(3)

     A   B   C
Tim  0   3   6
Tom  9  12  15

# Select the second row of the DataFrame df2 and assign it to the variable s. Use the iloc indexer to select rows and columns by integer location. And Perform element-wise subtraction between the DataFrame df2 and the Series s

In [15]:
s = df2.iloc[1]
print(s)
df2 -s

A    3
C    4
D    5
Name: Kate, dtype: int64

      A  C  D
Tim  -3 -3 -3
Kate  0  0  0
Tom   3  3  3

# Select the column labeled "A" from the DataFrame df2 and assigns it to the variable s2

In [16]:
s2 = df2["A"]
s2

Tim     0
Kate    3
Tom     6
Name: A, dtype: int64

# Perform element-wise subtraction between the DataFrame df2 and the Series s2 along the rows (axis=0).

In [17]:
df2.sub(s2 , axis=0)

      A  C  D
Tim   0  1  2
Kate  0  1  2
Tom   0  1  2

<h1 style = "color: blue">Applying a Function</h1>

# Create a DataFrame named df with 4 rows and 3 columns. The values in the DataFrame should be generated from a random normal distribution using the np.random.randn function. The column labels should be set as "A", "B", and "C", while the row labels should be set as "Kim", "Susan", "Tim", and "Tom".

In [18]:
df = pd.DataFrame(np.random.randn(4,3),
                 index= ["Kim", "Susan", "Tim", "Tom"],
                 columns = list("ABC"))
df

              A         B         C
Kim    0.538819 -2.147877  1.896065
Susan  0.399668 -0.048253  1.138680
Tim   -0.632534  2.004313  1.689684
Tom    0.345578  0.402853 -2.149140

# Calculate the absolute values of each element in the DataFrame df

In [19]:
np.abs(df)

              A         B         C
Kim    0.538819  2.147877  1.896065
Susan  0.399668  0.048253  1.138680
Tim    0.632534  2.004313  1.689684
Tom    0.345578  0.402853  2.149140

# Calculate the difference between the maximum and minimum values of a given input x using both Regular function and Lambda function

In [20]:
def calculate_range(x):
    return x.max() - x.min()
df.apply(calculate_range)

A    1.171353
B    4.152190
C    4.045205
dtype: float64

In [24]:
f_Lambda = lambda x:x.max() - x.min()  
df.apply(f_Lambda)

A    1.171353
B    4.152190
C    4.045205
dtype: float64

# Apply the lambda function f to each row (axis=1) of the DataFrame df

In [25]:
df.apply(f_Lambda, axis = 1)

Kim      4.043942
Susan    1.186933
Tim      2.636847
Tom      2.551992
dtype: float64

# Task

# Define a regular function named f that takes an input x and returns the square of x. Also apply this function to each element of the DataFrame df using the apply method.

In [26]:
f = lambda x: x**2
df.apply(f)

              A         B         C
Kim    0.290326  4.613376  3.595064
Susan  0.159735  0.002328  1.296592
Tim    0.400100  4.017271  2.855031
Tom    0.119424  0.162290  4.618801